app/controllers/solicituds_controller.rb

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    @solicituds = Solicitud.where(:user_id => current_user.id).order("created_at DESC")

INSERT INTO "solicituds" ("nombredelevento", "numeroDeAsistentes", "descripcion", "estado", "computadores", "videoBeam", "comentarios", "expedicion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @solicitud = current_user.solicituds.build(solicitud_params)

    respond_to do |format|
      if @solicitud.save

DELETE FROM "solicituds" WHERE "solicituds"."id" = ?  [["id", 4]]
---
  def destroy
    @solicitud.destroy

SELECT  "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_solicitud
      @solicitud = Solicitud.find(params[:id])